In [1]:
import pandas as pd

# Sample DataFrame
data = {'timestamp': ['2023-01-15 08:00:00', '2023-01-20 12:30:00', '2023-02-05 14:45:00', '2023-02-10 09:15:00'],
        'value': [100, 200, 150, 250]}

df = pd.DataFrame(data)

# Convert 'timestamp' column to datetime
df['timestamp'] = pd.to_datetime(df['timestamp'])

In [5]:
df

            timestamp  value
0 2023-01-15 08:00:00    100
1 2023-01-20 12:30:00    200
2 2023-02-05 14:45:00    150
3 2023-02-10 09:15:00    250

In [2]:
# Group by month and sum the 'value' column
monthly_df = df.set_index('timestamp').resample('M').sum()

In [3]:
monthly_df.reset_index(inplace=True)

In [4]:
monthly_df

   timestamp  value
0 2023-01-31    300
1 2023-02-28    400